#9.	Даны значения курса доллара по всем дням предыдущего месяца.
# Вывести в виде таблицы Год, Месяц, День, Курс.
# Найдите среднее значение курса. При выводе используйте формат вывода, курс с 2 знаками после запятой.

currency_values = [72.67, 73.12, 72.89, 72.45, 72.76, 73.01, 73.22, 73.42, 73.15, 73.55, 73.11, 72.87, 72.99, 73.33, 73.64, 73.45, 73.56, 73.78, 73.92, 73.74, 73.98, 73.81, 73.68, 73.45, 73.51, 73.28, 73.17, 72.95, 73.09, 72.91, 72.76]


#год, месяц, день и курс
year = 2022
month = 1
days = range(1, len(currency_values) + 1)

#таблица значений курса доллара
print("Год\tМесяц\tДень\tКурс")
for day, value in zip(days, currency_values):
    print(f"{year}\t{month}\t{day}\t{value:.2f}")#2 знака после запятой

#среднее значение курса доллара
average_value = sum(currency_values) / len(currency_values)
print(f"Средний курс доллара: {average_value:.2f}")